Reddit/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mTARCZQokPg7C79VAyv3LA"], ["updated_at", "2021-02-15 21:49:25.059431"], ["id", 1]]
---
    def reset_sesssion_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!